<?php
namespace app\common;

class Poem {
	static function getPoemTitles() {
		return [
			"蝶恋花" => "蝶恋花",
			"浣溪沙" => "浣溪沙",
			"菩萨蛮" => "菩萨蛮",
			"南乡子" => "南乡子",
			"醉花阴" => "醉花阴",
			"鹧鸪天" => "鹧鸪天",
			"临江仙" => "临江仙",
			"虞美人" => "虞美人",
			"水调歌头" => "水调歌头",
			"念奴娇" => "念奴娇",
			"满江红" => "满江红",
			"点绛唇" => "点绛唇",
			"清平乐" => "清平乐",
			"水龙吟" => "水龙吟",
			"减字木兰花" => "减字木兰花",
			"满庭芳" => "满庭芳",
			"朝中措" => "朝中措",
			"卜算子" => "卜算子",
			"贺新郎" => "贺新郎",
			"沁园春" => "沁园春",
			"谒金门" => "谒金门",
		];
	}
}
